jtenniswood/espframe/third_party/microlink/examples/cellular_connect/sdkconfig.defaults
# MicroLink v2 Cellular Connect — ESP32-S3
# Board selection: change via menuconfig (Waveshare SIM7600X or LILYGO T-SIM7670G-S3)
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# lwIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
# PPP support
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_LWIP_PPP_ENABLE_IPV6=n
CONFIG_LWIP_PPP_VJ_HEADER_COMPRESSION=n

# mbedTLS (Noise protocol + TLS)
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# CPU frequency (240MHz for crypto performance)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Main task stack (cellular init + AT commands need more stack)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Watchdog (extended for TLS handshakes over cellular)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# UART — ensure console UART doesn't conflict with modem UART
CONFIG_ESP_CONSOLE_UART_NUM=0

# MicroLink — enable cellular modem (board selected via menuconfig)
CONFIG_ML_ENABLE_CELLULAR=y

# Cellular APN (REQUIRED for PPP — without this, IPCP gets no response)
# Google Fi: h2g2, Soracom: soracom.io, Teal: teal
CONFIG_ML_CELLULAR_APN="america.bics"

# HTTP Config Server (runtime WiFi/auth/peer config via web UI)
CONFIG_ML_ENABLE_CONFIG_HTTPD=y
CONFIG_ML_CONFIG_MAX_ALLOWED_PEERS=512

# Priority peer (guaranteed WG slot even when peer table is full)
CONFIG_ML_PRIORITY_PEER_IP=""
